import spacy # Чтобы все норм работало, надо через терминал установить эту библиотеку
import os
import re

class Letter:
    def __init__(self, text):
        self.text = text
        self.set_strange_words_num(self)
        self.set_shift_letters_num(self)
        self.set_exclam_marks_num(self)

    def set_shift_letters_num(self):
        shift_letters_num = 0
        # Тут надо написать функцию, которая считает отношение букв верхнего регистра к общему числу букв
        self._shift_letters_num = shift_letters

    def set_exclam_marks_num(self):
        exclam_marks_num = 0
        # Тут надо написать функцию, которая считает отношение кол-ва "!" ко всем символам
        self._exclam_marks_num = exclam_marks_num


    # Вот тут надо с помощью spacy сделать токенизацию + лемматизацию текста


    def count_strange_words_num(self):
        strange_words_num = 0
        # Тут надо прописать функцию, которая считает отношение "спам-слов" к вообще всем словам в тексте.
        self._strange_words_num = strange_words_num

    def is_spam(self):
        pass
        # Это итоговая функция, которая будет вовзращать ответ: спам/не спам + краткий комментарий

def get_letter_by_user(user_file_name):
    pass # Эта функция по имени файла, которое ввел пользователь, должна либо поднять ошибку, если такого файла нет,
    # либо вернуть текст
    # Для проверки расширений мб пригодятся регулярки (библиотека re)
    # Сначала надо проверить, что расширение у имени файла, которое ввёл пользователь .txt
    # Если .txt ==> искать по папкам. Если ничего не нашлось ==> поднять ошибку.
    # Если пользователь не указал расширение/указал, но забыл какую-то часть (e.g. name.tx), то добавить недостающее
    # Затем проделать то же самое, что и для файлов .txt
    # Если же расширение уже есть, но оно не .txt ==> пока что поднимаем ошибку

    # return text - как-то так должна выглядеть строка с возвратом результата
